src/cf/Catalogs/ЗаписиКалендаряСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЗаписиКалендаряСотрудника</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Завершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникЗаписейКалендаря</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендариСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолонкаКалендаря</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КолонкиКалендарейСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиИсточника</Name>
					<Comment>Для связи со строкой табличной части источника</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйИсточника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактированиеЗапрещено</Name>
					<Comment>Запрет интерактивного редактирования записи в планировщике</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьETag</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКлюч</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ЗаписиКалендаряСотрудника/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Сохранить изменения записей календарей.
// 
// Параметры:
//  ОбрабатываемыеЭлементы - Массив из Структура
// 
// Возвращаемое значение:
//  Булево - Результат сохранения
Функция СохранитьИзмененияЗаписейКалендарей(ОбрабатываемыеЭлементы) Экспорт
	
	НезависимыеЗаписи = Новый Массив;
	ПодчиненныеИсточнику = Новый Соответствие;
	
	Для Каждого ОбрабатываемыйЭлемент Из ОбрабатываемыеЭлементы Цикл
		Если ЗначениеЗаполнено(ОбрабатываемыйЭлемент.Источник) 
			И ТипЗнч(ОбрабатываемыйЭлемент.ЗаписьКалендаря) <> Тип("ДокументСсылка.ЗадачаСотрудника") 
			И ЗначениеЗаполнено(ОбрабатываемыйЭлемент.ЗаписьКалендаря) Тогда
			ЗаписиПоИсточнику = ПодчиненныеИсточнику.Получить(ОбрабатываемыйЭлемент.Источник);
			Если ЗаписиПоИсточнику = Неопределено Тогда
				ЗаписиПоИсточнику = Новый Массив;
				ЗаписиПоИсточнику.Добавить(ОбрабатываемыйЭлемент);
				ПодчиненныеИсточнику.Вставить(ОбрабатываемыйЭлемент.Источник, ЗаписиПоИсточнику);
			Иначе
				ЗаписиПоИсточнику.Добавить(ОбрабатываемыйЭлемент);
			КонецЕсли;
		Иначе
			НезависимыеЗаписи.Добавить(ОбрабатываемыйЭлемент);
		КонецЕсли;
	КонецЦикла;
	
	НачатьТранзакцию();
	
	Попытка
	
		Для Каждого КлючИЗначение Из ПодчиненныеИсточнику Цикл
			
			ИсточникОбъект = КлючИЗначение.Ключ.ПолучитьОбъект();
			
			Если ОбрабатываемыйЭлемент.Свойство("ПометкаУдаления") Тогда
				ИсточникОбъект.УстановитьПометкуУдаления(ОбрабатываемыйЭлемент.ПометкаУдаления);
				Продолжить;
			КонецЕсли;
			
			ИсточникОбъект.ОбновитьИсточникПриИзмененииЗаписиКалендаря(КлючИЗначение.Значение);
			ИсточникОбъект.Записать();
			
		КонецЦикла;
		
		Для Каждого ОбрабатываемыйЭлемент Из НезависимыеЗаписи Цикл
			
			Если НЕ ЗначениеЗаполнено(ОбрабатываемыйЭлемент.ЗаписьКалендаря) 
				И НЕ ЗначениеЗаполнено(ОбрабатываемыйЭлемент.Источник) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТипЗнч(ОбрабатываемыйЭлемент.ЗаписьКалендаря) <> Тип("ДокументСсылка.ЗадачаСотрудника") 
				И ЗначениеЗаполнено(ОбрабатываемыйЭлемент.ЗаписьКалендаря) Тогда
				ЗаписьОбъект = ОбрабатываемыйЭлемент.ЗаписьКалендаря.ПолучитьОбъект();
			Иначе
				ЗаписьОбъект = ОбрабатываемыйЭлемент.Источник.ПолучитьОбъект();	
			КонецЕсли;
			
			Если ОбрабатываемыйЭлемент.Свойство("ПометкаУдаления") Тогда
				ЗаписьОбъект.УстановитьПометкуУдаления(ОбрабатываемыйЭлемент.ПометкаУдаления);
				Продолжить;
			КонецЕсли;
			
			ЗаписьОбъект.ДатаНачала		= ОбрабатываемыйЭлемент.Начало;
			ЗаписьОбъект.ДатаОкончания	= ОбрабатываемыйЭлемент.Конец;
			ЗаписьОбъект.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		Успешно = Истина;
		
	Исключение
		
		ОтменитьТранзакцию();
		Успешно = Ложь;
		ВызватьИсключение СтрШаблон(НСтр("ru='Не удалось сохранить изменения в календаре по причине: %1'"), 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
	Возврат Успешно;
	
КонецФункции

// Функция возвращает таблицу описаний возможных расширенных вводов записи календаря
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с колонками:
//   * ИмяФормы - Строка - полный путь к форме для использования в ОтрытьФорму()
//   * ПараметрыФормы - Структура - параметры открываемой формы
//   * Представление - Строка - пользовательское представление расширенного ввода
Функция ОписаниеРасширенногоВводаЗаписей() Экспорт
	
	ТаблицаОписания = Новый ТаблицаЗначений;
	ТаблицаОписания.Колонки.Добавить("ИмяФормы", Новый ОписаниеТипов("Строка"));
	ТаблицаОписания.Колонки.Добавить("ПараметрыФормы", Новый ОписаниеТипов("Структура"));
	ТаблицаОписания.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	
	ТипыЗаписей = ЗадачиСотрудника.ДоступныеТипыМенюСозданияСобытияКалендаря();
	
	Для Каждого ТипЗаписиКалендаря Из ТипыЗаписей Цикл
		
		Если ТипЗаписиКалендаря = Тип("ДокументСсылка.ЗаказПокупателя")
			Или ТипЗаписиКалендаря = Тип("ДокументСсылка.ЗаказНаПроизводство")
			Тогда
			Продолжить
		КонецЕсли;
		
		МетаданныеТипа = Метаданные.НайтиПоТипу(ТипЗаписиКалендаря);
		МенеджерТипа = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(МетаданныеТипа.ПолноеИмя());
		
		МенеджерТипа.ПриЗаполненииРасширенногоВводаЗаписиКалендаря(ТаблицаОписания);
		
	КонецЦикла;
	
	ТаблицаОписания.Сортировать("Представление УБЫВ");
	
	Возврат ТаблицаОписания;
	
КонецФункции

#Область Google

// Возвращает Объект справочника ЗаписиКалендаря по идентификатору.
// 
// Параметры:
//  Идентификатор - Строка
//  Календарь - СправочникСсылка.КалендариСотрудников
// 
// Возвращаемое значение:
//  СправочникОбъект.ЗаписиКалендаряСотрудника - Объект идентификатора
Функция ОбъектПоИдентификатору(Идентификатор, Календарь) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаписиКалендаряСотрудника.Ссылка
	|ИЗ
	|	Справочник.ЗаписиКалендаряСотрудника КАК ЗаписиКалендаряСотрудника
	|ГДЕ
	|	ЗаписиКалендаряСотрудника.Ключ = &Ключ
	|	И ЗаписиКалендаряСотрудника.Календарь = &Календарь");
	
	Запрос.УстановитьПараметр("Ключ",
		ОбменСGoogle.КлючИзИдентификатора(Идентификатор, ТипЗнч(Справочники.ЗаписиКалендаряСотрудника)));
	Запрос.УстановитьПараметр("Календарь", Календарь);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Результат = СоздатьЭлемент();
		Результат.УстановитьНовыйКод();
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка.ПолучитьОбъект();
	
КонецФункции

#Область ИнтерфейсРабочегоПроцесса

// Состав полей заполнения для рабочего процесса.
// 
// Параметры:
// 	ТаблицаОписанияПолей - ТаблицаЗначений
// 	ТипДействия - ПеречислениеСсылка.ТипыДействийРабочегоПроцесса
Процедура СоставПолейЗаполненияДляРабочегоПроцесса(ТаблицаОписанияПолей, знач ТипДействия) Экспорт
	
	ЗаписиКалендаряМД = Метаданные.Справочники.ЗаписиКалендаряСотрудника;
	
	НовоеОписание = ТаблицаОписанияПолей.Добавить();
	НовоеОписание.ИмяРеквизита				= ЗаписиКалендаряМД.Реквизиты.Календарь.Имя;
	НовоеОписание.Заголовок					= ЗаписиКалендаряМД.Реквизиты.Календарь.Синоним;
	НовоеОписание.ВариантЗаполнения			= "Указанный";
	НовоеОписание.ТипЗначения				= ЗаписиКалендаряМД.Реквизиты.Календарь.Тип;
	НовоеОписание.ОбязательноеЗаполнение	= Истина;
	
	НовоеОписание = ТаблицаОписанияПолей.Добавить();
	НовоеОписание.ИмяРеквизита				= ЗаписиКалендаряМД.Реквизиты.Начало.Имя;
	НовоеОписание.Заголовок					= ЗаписиКалендаряМД.Реквизиты.Начало.Синоним;
	НовоеОписание.ВариантЗаполнения			= "Смещение";
	НовоеОписание.ТипЗначения				= ЗаписиКалендаряМД.Реквизиты.Начало.Тип;
	НовоеОписание.ОбязательноеЗаполнение	= Истина;
	
	НовоеОписание = ТаблицаОписанияПолей.Добавить();
	НовоеОписание.ИмяРеквизита				= ЗаписиКалендаряМД.Реквизиты.Окончание.Имя;
	НовоеОписание.Заголовок					= ЗаписиКалендаряМД.Реквизиты.Окончание.Синоним;
	НовоеОписание.ВариантЗаполнения			= "Смещение";
	НовоеОписание.ТипЗначения				= ЗаписиКалендаряМД.Реквизиты.Окончание.Тип;
	НовоеОписание.ОбязательноеЗаполнение	= Истина;
	
	НовоеОписание = ТаблицаОписанияПолей.Добавить();
	НовоеОписание.ИмяРеквизита				= "Наименование";
	НовоеОписание.Заголовок					= НСтр("ru='Представление'");
	НовоеОписание.ВариантЗаполнения			= "Указанный";
	НовоеОписание.ТипЗначения				= ОбщегоНазначения.ОписаниеТипаСтрока(ЗаписиКалендаряМД.ДлинаНаименования);
	НовоеОписание.ОбязательноеЗаполнение	= Истина;
	
	НовоеОписание = ТаблицаОписанияПолей.Добавить();
	НовоеОписание.ИмяРеквизита				= ЗаписиКалендаряМД.Реквизиты.Описание.Имя;
	НовоеОписание.Заголовок					= ЗаписиКалендаряМД.Реквизиты.Описание.Синоним;
	НовоеОписание.ВариантЗаполнения			= "Указанный";
	НовоеОписание.ТипЗначения				= ЗаписиКалендаряМД.Реквизиты.Описание.Тип;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли
